mistyk/inavradar-ESP32/src/main.cpp
  Command* config = new Command("config", [](Cmd* cmd) {
    String arg1 = cmd->getValue(0);
    String arg2 = cmd->getValue(1);
    if (arg1 == "") cliConfig(cNum);
    if (arg1 == "loraFreq") {
      if ( arg2.toInt() == 433E6 || arg2.toInt() == 868E6 || arg2.toInt() == 915E6) {
        cfg.loraFrequency = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Lora frequency changed!");
      } else {
        serialConsole[cNum]->println("Lora frequency not correct: 433000000, 868000000, 915000000");
      }
    }
    if (arg1 == "loraBandwidth") {
      if (arg2.toInt() == 250000 || arg2.toInt() == 62500 || arg2.toInt() == 7800) {
        cfg.loraBandwidth = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Lora bandwidth changed!");
      } else {
        serialConsole[cNum]->println("Lora bandwidth not correct: 250000, 62500, 7800");
      }
    }
    if (arg1 == "loraSpread") {
    if (arg2.toInt() >= 7 && arg2.toInt() <= 12) {
        cfg.loraSpreadingFactor = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Lora spreading factor changed!");
      } else {
        serialConsole[cNum]->println("Lora spreading factor not correct: 7 - 12");
      }
    }
    if (arg1 == "loraPower") {
    if (arg2.toInt() >= 0 && arg2.toInt() <= 20) {
        cfg.loraPower = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Lora power factor changed!");
      } else {
        serialConsole[cNum]->println("Lora power factor not correct: 0 - 20");
      }
    }
    if (arg1 == "fctimeout") {
      if (arg2.toInt() >= 1 && arg2.toInt() <= 250) {
        cfg.fcTimeout = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("FC timout changed!");
      } else {
        serialConsole[cNum]->println("FC timout not correct: 1 - 250");
      }
    }
    if (arg1 == "radiointerval") {
      if (arg2.toInt() >= 50 && arg2.toInt() <= 1000) {
        cfg.intervalSend = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("Radio interval changed!");
      } else {
        serialConsole[cNum]->println("Radio interval not correct: 50 - 1000");
      }
    }
    if (arg1 == "uavtimeout") {
      if (arg2.toInt() >= 5 && arg2.toInt() <= 600) {
        cfg.uavTimeout = arg2.toInt();
        saveConfig();
        serialConsole[cNum]->println("UAV timeout changed!");
      } else {
        serialConsole[cNum]->println("UAV timeout not correct: 5 - 600");
      }
    }
    if (arg1 == "debuglat") {
      if (1) {
        serialConsole[cNum]->println(arg2);
        float lat = arg2.toFloat() * 10000000;
        cfg.debugGpsLat = (int32_t) lat;
        saveConfig();
        serialConsole[cNum]->println("Debug GPS lat changed!");
      } else {
        serialConsole[cNum]->println("Debug GPS lat not correct: 50.088251");
      }
    }
    if (arg1 == "debuglon") {
      if (1) {
        float lon = arg2.toFloat() * 10000000;
        cfg.debugGpsLon = (int32_t) lon;
        saveConfig();
        serialConsole[cNum]->println("Debug GPS lon changed!");
      } else {
        serialConsole[cNum]->println("Debug GPS lon not correct: 8.783871");
      }
    }
  });
  config->addArg(new AnonymOptArg(""));
  config->addArg(new AnonymOptArg(""));

  cli->addCmd(config);
  //cli->parse("ping");
  //cli->parse("hello");
}
// ----------------------------------------------------------------------------- Logger
void initLogger () {

}
// ----------------------------------------------------------------------------- LoRa
void sendMessage(planeData *outgoing) {
  if (loraSeqNum < 255) loraSeqNum++;
  else loraSeqNum = 0;
  pd.seqNum = loraSeqNum;
  while (!LoRa.beginPacket()) {  }
  LoRa.write((uint8_t*)outgoing, sizeof(fakepd));
  LoRa.endPacket(false);
}

void onReceive(int packetSize) {
  if (packetSize == 0) return;
  LoRa.readBytes((uint8_t *)&loraMsg, packetSize);
  //cliLog(loraMsg.header);
  //cliLog(cfg.loraHeader);
  if (String(loraMsg.header) == String(cfg.loraHeader)) { // new plane data
      //cliLog(cfg.loraHeader);
      rssi = String(LoRa.packetRssi());
      ppsc++;
      loraRX = 1;
      pdIn = loraMsg;
      cliLog("New air packet");
      uint8_t id = loraMsg.id - 1;
      pds[id].id = loraMsg.id;
      pds[id].pd = loraMsg;
      pds[id].rssi = LoRa.packetRssi();
      pds[id].pd.state = 1;
      pds[id].lastUpdate = millis();
      cliLog("UAV DB update POI #" + String(loraMsg.id));
  }
}
int moving = 0;
void sendFakePlanes () {
  if (loraSeqNum < 255) loraSeqNum++;
  else loraSeqNum = 0;
  pd.seqNum = loraSeqNum;
  if (cfg.debugFakeMoving && moving > 100) {
    moving = 0;
  } else {
    if (!cfg.debugFakeMoving) moving = 0;
  }
  cliLog("Sending fake UAVs via radio ...");
  String("IRP2").toCharArray(fakepd.header,5);
  //fakepd.loraAddress = (char)5;
  String("Testplane #1").toCharArray(fakepd.planeName,20);
  if (loraSeqNum < 255) loraSeqNum++;
  else loraSeqNum = 0;
  fakepd.seqNum = loraSeqNum;
  fakepd.state=  1;
  fakepd.id = pd.id;
  fakepd.gps.alt = 300;
  fakepd.gps.groundSpeed = 450;
  fakepd.gps.lat = cfg.debugGpsLat; // + (250 * moving);
  fakepd.gps.lon = cfg.debugGpsLon + (250 * moving);
  sendMessage(&fakepd);
  cliLog("Fake UAVs sent.");
  moving++;
}
void initLora() {
	display.drawString (0, 16, "LORA");
  display.display();
  cliLog("Starting radio ...");
  //pd.loraAddress = cfg.loraAddress;
  String(cfg.loraHeader).toCharArray(pd.header,5);
  SPI.begin(5, 19, 27, 18);
  LoRa.setPins(SS,RST,DI0);
  if (!LoRa.begin(cfg.loraFrequency)) {
    cliLog("Radio start failed!");
    display.drawString (94, 8, "FAIL");
    while (1);
  }
  LoRa.sleep();
  LoRa.setSignalBandwidth(cfg.loraBandwidth);
  LoRa.setCodingRate4(cfg.loraCodingRate4);
  LoRa.setSpreadingFactor(cfg.loraSpreadingFactor);
  LoRa.setTxPower(cfg.loraPower,1);
  LoRa.setOCP(200);
  LoRa.idle();
  LoRa.onReceive(onReceive);
  LoRa.enableCrc();
  pd.id = 0;
  loraMode = LA_INIT;
  LoRa.receive();
  cliLog("Radio started.");
  display.drawString (100, 16, "OK");
  display.display();
}
// ----------------------------------------------------------------------------- Display
void displayArmed () {
  display.clear();
  display.setFont (ArialMT_Plain_24);
  display.setTextAlignment (TEXT_ALIGN_LEFT);
  display.drawString (20,20, "Armed");
  display.display();
  delay(250);
  display.clear();
  display.display();
  displayon = 0;
}
void displayDisarmed () {
  display.clear();
  display.setFont (ArialMT_Plain_24);
  display.setTextAlignment (TEXT_ALIGN_LEFT);
  display.drawString (20,20, "Disarmed");
  display.display();
  delay(250);
  displayon = 1;
}
void drawDisplay () {
  display.clear();
  if (displayPage == 0) {
    display.setFont (ArialMT_Plain_24);
    display.setTextAlignment (TEXT_ALIGN_RIGHT);
    display.drawString (30,5, String(pd.gps.numSat));
    display.drawString (30,30, String(numPlanes));
    display.drawString (114,5, String((float)fcanalog.vbat/10));
    display.setFont (ArialMT_Plain_10);
    display.drawString (110,30, String(pps));
    display.drawString (110,42, rssi);
    display.setTextAlignment (TEXT_ALIGN_LEFT);
    //if (pd.gps.fixType == 0) display.drawString (33,7, "NF");
    if (pd.gps.fixType == 1) display.drawString (33,7, "2D");
    if (pd.gps.fixType == 2) display.drawString (33,7, "3D");
    display.drawString (33,16, "SAT");
    display.drawString (33,34, "ID");
    display.drawString (49,34, String(pd.id));
    display.drawString (33,42, "UAV");
    display.drawString (116,16, "V");
    display.drawString (112,30, "pps");
    display.drawString (112,42, "dB");
    if (String(planeFC) == String("No FC")) {
      if (cfg.debugOutput) {
        if (cfg.debugFakeWPs) display.drawString (0,54, "LFP");
        if (cfg.debugFakePlanes) display.drawString (30,54, "RFP");
        if (cfg.debugFakeMoving) display.drawString (60,54, "MFP");
      }
    } else {
      //if (bitRead(fcstatusex.armingFlags,17) == 0) display.drawString (0,54, "RC LINK LOST");
      //else
      // TODO
      display.drawString (0,54, pd.planeName);
      //if (fcstatusex.armingFlags != 0) display.drawXbm(61, 54, 8, 8, warnSymbol);
    }
    display.drawString (84,54, "TX");
    display.drawString (106,54, "RX");
    display.drawXbm(98, 55, 8, 8, loraTX ? activeSymbol : inactiveSymbol);
    display.drawXbm(120, 55, 8, 8, loraRX ? activeSymbol : inactiveSymbol);
  }
  if (displayPage == 1) {
    if (numPlanes == 0) display.drawString (0,0, "no UAVs detected ...");
    else {
      display.setFont (ArialMT_Plain_10);
      for (size_t i = 0; i <=2 ; i++) {
        if (pds[i].id != 0) {
          display.setTextAlignment (TEXT_ALIGN_LEFT);
          display.drawString (0,i*16, pds[i].pd.planeName);
          display.drawString (0,8+i*16, "RSSI " + String(pds[i].rssi));
          display.setTextAlignment (TEXT_ALIGN_RIGHT);
          display.drawString (128,i*16, String((float)pds[i].pd.gps.lat/10000000,6));
          display.drawString (128,8+i*16, String((float)pds[i].pd.gps.lon/10000000,6));
        }
      }
    }
  }
  if (displayPage == 2) {
    display.setFont (ArialMT_Plain_10);
    for (size_t i = 0; i <=1 ; i++) {
      if (pds[i].id != 0) {
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString (0,i*16, pds[i+3].pd.planeName);
        display.drawString (0,8+i*16, "RSSI " + String(pds[i].rssi));
        display.setTextAlignment (TEXT_ALIGN_RIGHT);
        display.drawString (65,i*16, String((float)pds[i+3].pd.gps.lat/10000000,6));
        display.drawString (65,8+i*16, String((float)pds[i+3].pd.gps.lon/10000000,6));
      }
    }
  }
  display.display();
}

void initDisplay () {
  cliLog("Starting display ...");
  pinMode (16, OUTPUT);
  pinMode (2, OUTPUT);
  digitalWrite (16, LOW); // set GPIO16 low to reset OLED
  delay (50);
  digitalWrite (16, HIGH); // while OLED is running, GPIO16 must go high
  display.init ();
  display.flipScreenVertically ();
  display.setFont (ArialMT_Plain_10);
  display.setTextAlignment (TEXT_ALIGN_LEFT);
  display.drawString (0, 0, "DISPLAY");
  display.drawString (100, 0, "OK");
  display.drawString (0, 8, "FIRMWARE");
  display.drawString (100, 8, VERSION);
  display.display();
  cliLog("Display started!");
}
// ----------------------------------------------------------------------------- MSP and FC
void getPlanetArmed () {
  uint32_t planeModes;
  msp.getActiveModes(&planeModes);
  pd.state = bitRead(planeModes,0);
  cliLog("FC: Arm state " + String(pd.state));
}

void getPlaneGPS () {
  if (msp.request(MSP_RAW_GPS, &pd.gps, sizeof(pd.gps))) {
    cliLog("FC: GPS " + String(pd.gps.fixType));
  }
}

void getPlaneBat () {
  if (msp.request(MSP_ANALOG, &fcanalog, sizeof(fcanalog))) {
    cliLog("FC: Bat " + String(fcanalog.vbat));
  }
}
void getPlaneStatusEx () {
  if (msp.request(MSP_STATUS_EX, &fcstatusex, sizeof(fcstatusex))) {
    cliLog("FC: Status EX " + String(bitRead(fcstatusex.armingFlags,18)));
  }
}
void getPlaneData () {
  for (size_t i = 0; i < 5; i++) {
    pd.planeName[i] = (char) random(65,90);
  }
  if (msp.request(MSP_NAME, &pd.planeName, sizeof(pd.planeName))) {
    cliLog("FC: UAV name " + String(pd.planeName));
  }
  String("No FC").toCharArray(planeFC,20);
  if (msp.request(MSP_FC_VARIANT, &planeFC, sizeof(planeFC))) {
    cliLog("FC: Firmware " + String(planeFC));
  }
}
void planeSetWP () {
  msp_radar_pos_t radarPos;
  for (size_t i = 0; i <= 4; i++) {
    if (pds[i].id != 0) {
//      wp.waypointNumber = pds[i].waypointNumber;
//      wp.action = MSP_NAV_STATUS_WAYPOINT_ACTION_WAYPOINT;
      radarPos.id = i;
      radarPos.state = pds[i].pd.state;
      radarPos.lat = pds[i].pd.gps.lat;
      radarPos.lon = pds[i].pd.gps.lon;
      radarPos.alt = pds[i].pd.gps.alt;
      radarPos.speed = pds[i].pd.gps.groundSpeed;
      radarPos.heading = pds[i].pd.gps.groundCourse / 10;
      if (millis() - pds[i].lastUpdate < cfg.intervalSend+100) radarPos.lq =  constrain ( (130 + pds[i].rssi ) , 1 , 100);
      else radarPos.lq = 0;
      msp.command(MSP_SET_RADAR_POS, &radarPos, sizeof(radarPos));
      cliLog("Sent to FC - POI #" + String(i));
    }
  }
}
void planeFakeWPv2 () {
  /*
  msp_raw_planes_t wp;
  wp.id = 1;
  wp.arm_state = 1;
  wp.lat = 50.1006770 * 10000000;
  wp.lon = 8.7613380 * 10000000;
  wp.alt = 100;
  wp.heading = 0;
  wp.speed = 0;
  wp.callsign0 = 'D';
  wp.callsign1 = 'A';
  wp.callsign2 = 'N';
  msp.commandv2(MSP2_ESP32, &wp, sizeof(wp));
  */
}

